<script lang="ts">
    import { base } from "$app/paths";
    import Navbar from "$lib/components/Navbar.svelte";
</script>

{#snippet Image(id: number)}
    {#await import(`$lib/images/2/${id}.png`) then { default: image } }
        <img alt="" class="self-center w-min h-auto max-w-[85%]" src={image}>
    {/await}
{/snippet}

<Navbar name="Задача 125-летней давности"></Navbar>
<article class="animate-fade-in-scale flex flex-col bg-secondary w-[85%] md:w-[50%] h-fit mx-auto mb-10 rounded-md">
    <p class="m-8 text-text text-lg md:text-xl font-jetbrains">
        Когда величайший из живущих математиков излагает своё видение касательно следующего столетия исследований, математический мир внимательно его слушает. Именно это произошло в 1900 году на Международном конгрессе математиков в университете Сорбонны в Париже. Легендарный математик Дэвид Гильберт представил 10 нерешённых проблем в качестве амбициозных ориентиров для XX века. Позже он расширил свой список, включив в него 23 проблемы, и их влияние на математическую мысль за последние 125 лет трудно переоценить.
        <br>
        <br>
        <a class="text-accent underline hover:text-text" href="https://ru.wikipedia.org/wiki/%D0%A8%D0%B5%D1%81%D1%82%D0%B0%D1%8F_%D0%BF%D1%80%D0%BE%D0%B1%D0%BB%D0%B5%D0%BC%D0%B0_%D0%93%D0%B8%D0%BB%D1%8C%D0%B1%D0%B5%D1%80%D1%82%D0%B0">
            Шестая проблема Гильберта
        </a> была одной из самых возвышенных. Он призвал «аксиоматизировать» физику, или определить минимум математических предположений, лежащих в основе всех её теорий. В широком смысле этого слова неясно, смогут ли математические физики когда-либо узнать, решили ли они эту задачу. Однако Гильберт упомянул некоторые конкретные подцели, и с тех пор исследователи доработали его концепцию до конкретных шагов на пути к её решению.
        <br>
        <br>
        В марте математики Ю Денг из Чикагского университета, Захер Хани и Сяо Ма из Мичиганского университета разместили на сервере препринтов arXiv.org новую 
        <a class="text-accent underline hover:text-text" href="https://arxiv.org/pdf/2503.01800">
            работу
        </a>, в которой утверждают, что им удалось решить одну из этих задач. Если их работа выдержит проверку, она станет важным шагом на пути к обоснованию физики в математике и может открыть дверь для аналогичных прорывов в других областях физики.
        <br>
        <br>
        В статье исследователи утверждают, что им удалось объединить три физические теории, объясняющие движение жидкостей. Эти теории лежат в основе целого ряда инженерных приложений — от проектирования самолётов до предсказания погоды, — но до сих пор они опирались на предположения, которые не были строго доказаны. Этот прорыв не изменит сами теории, но он математически обосновывает их и укрепляет нашу уверенность в том, что уравнения работают так, как мы думаем.
        <br>
        <br>
        Каждая теория отличается тем, насколько приблизительно она описывает текущую жидкость или газ. На микроскопическом уровне жидкости состоят из частиц – приблизительно их можно представить себе в виде маленьких бильярдных шаров, которые вращаются и иногда сталкиваются, — и законы движения Ньютона хорошо описывают их траектории.
        <br>
        <br>
        Но когда вы увеличиваете масштаб и рассматриваете коллективное поведение огромного количества частиц, так называемый мезоскопический уровень, моделировать каждую из них по отдельности уже неудобно. В 1872 году австрийский физик-теоретик Людвиг Больцман решил эту проблему, разработав уравнение Больцмана. Вместо того чтобы отслеживать поведение каждой частицы, уравнение рассматривает вероятное поведение типичной частицы. Эта статистическая перспектива сглаживает низкоуровневые детали в пользу высокоуровневых тенденций. Уравнение позволяет физикам рассчитать, как изменяются такие величины, как импульс и теплопроводность в жидкости, без кропотливого рассмотрения каждого микроскопического столкновения.
        <br>
        <br>
        Увеличьте масштаб, и вы окажетесь в макроскопическом мире. Здесь мы рассматриваем жидкости не как набор дискретных частиц, а как единую непрерывную субстанцию. На этом уровне анализа другой набор уравнений — уравнения Эйлера и Навье-Стокса — точно описывает движение жидкостей и взаимосвязь их физических свойств, не прибегая к частицам.
        <br>
        <br>
        Каждый из трёх уровней анализа описывает одну и ту же базовую реальность — движение жидкостей. В принципе, каждая теория должна опираться на теорию, стоящую ниже её в иерархии: уравнения Эйлера и Навье-Стокса на макроскопическом уровне должны логически вытекать из уравнения Больцмана на мезоскопическом уровне, которое, в свою очередь, должно логически вытекать из законов движения Ньютона на микроскопическом уровне. Именно к такой «аксиоматизации» призывал Гильберт в своей шестой проблеме, и он явно ссылался на работу Больцмана о газах в своём описании задачи. Мы ожидаем, что полные теории физики будут следовать математическим правилам, которые объясняют явления от микроскопического до макроскопического уровня. Если учёным не удаётся преодолеть этот разрыв, то это может свидетельствовать о непонимании существующих теорий.
        <br>
        <br>
        Объединение трёх точек зрения на гидродинамику было сложной задачей, но Денг, Хани и Ма, возможно, только что сделали это. Их достижение опирается на десятилетия постепенного прогресса. Однако все предыдущие достижения сопровождались определёнными оговорками: например, полученные результаты работали только на коротких временных интервалах, в вакууме или при других упрощающих условиях.
        <br>
        <br>
        Новое доказательство в целом состоит из трёх шагов: вывести макроскопическую теорию из мезоскопической; вывести мезоскопическую теорию из микроскопической; а затем сшить их вместе в едином выводе макроскопических законов из микроскопических.
        <br>
        <br>
        Первый шаг уже сделали в прошлом, и даже сам Гильберт внёс в него свой вклад. Выведение мезоскопических законов из микроскопических, с другой стороны, оказалось гораздо более сложным с математической точки зрения. Помните, что в мезоскопическом случае речь идёт о коллективном поведении огромного количества частиц. Поэтому Денг, Хани и Ма посмотрели, что происходит с уравнениями Ньютона, когда число отдельных частиц, сталкивающихся и рикошетирующих, растёт до бесконечности, а их размер уменьшается до нуля. Они доказали, что при растяжении уравнений Ньютона до таких пределов статистическое поведение системы — или вероятное поведение «типичной» частицы в жидкости — сходится к решению уравнения Больцмана. Этот шаг образует мост, выводя мезоскопическую математику из экстремального поведения микроскопической математики.
        <br>
        <br>
        Основным препятствием на этом этапе стала длительность моделирования уравнений. Уже было известно, как вывести уравнение Больцмана из законов Ньютона на очень коротких временных масштабах, но для требований Гильберта этого недостаточно, поскольку реальные жидкости могут течь сколь угодно долго. При больших временных масштабах возникает больше сложностей: происходит больше столкновений, и вся история взаимодействий частицы может повлиять на её текущее поведение. Авторы преодолели эту проблему, проведя тщательный учёт того, насколько сильно история частицы влияет на её настоящее поведение, и используя новые математические методы, утверждая, что суммарный эффект предыдущих столкновений остаётся небольшим.
        <br>
        <br>
        Приведя в соответствие своё открытие в области больших временных масштабов с предыдущей работой по выводу уравнений Эйлера и Навье-Стокса из уравнения Больцмана, учёные объединили три теории гидродинамики. Этот вывод оправдывает подход, в котором при описании жидкости физики исходят из того, что им будет наиболее полезно в данном контексте — ведь математически они сходятся к одной итоговой теории, описывающей одну реальность. Если предположить, что доказательство верно, то оно открывает новые горизонты в программе Гильберта. Остаётся только надеяться, что благодаря таким новым подходам плотина на проблемах Гильберта прорвётся и физика отправится далее, вниз по течению.
        <br>
        <br>
        <a class="text-accent underline hover:text-text" href="https://www.livescience.com/physics-mathematics/mathematics/mathematicians-just-solved-a-125-year-old-problem-uniting-3-theories-in-physics">
            Источник
        </a>
    </p>
</article>
<a href="{base}/" class="flex items-center justify-center w-[85%] md:w-[50%] h-16 mx-auto m-8 bg-secondary rounded-md align-middle text-center text-text text-xl font-bold font-jetbrains transition-all hover:bg-accent hover:text-secondary">
    Вернуться на главную
</a>